#!/usr/bin/env python
# coding: utf-8

# In[ ]:


#(1). 주제 선정 이유
     선정한 주제는 '타이타닉 사고 희생자와 생존자들의 데이터 분석을 통한 여객선 사고에서의 생존확률 구하기'이다.
    서헤훼리호, 세월호 사고와 같은 국내의 여객선 사고 사례들를 보며 구조 활동을 좀 더 효율적으로 할 수는 없는지, 
    마지막 위치와 성별, 연령대 등이 생존확률에 얼만큼 영향을 미치는지에 대한 궁금증이 들었다.
    관련 데이터를 찾아보았으나 공개된 데이터가 충분하지 않아 상대적으로 많은 데이터가 공개 된 타이타닉 사고를 분석하려 한다.
    나이, 성별, 등석, 사회적 지위, 마지막 위치에 따라 데이터를 분석 할 것이다.
    이렇게 분석된 데이터는 혹시나 모를 추후의 또다른 큰 여객선 사고에서 생존자들을 구해 내는 구조 활동이 보다 효율적으로 진행되도록 
    도움을 줄 것이며, 탑승객들로써는 이를 알아 두는 것만으로도 생존확률을 높일 수 있으리라 생각한다.
    
#(2). 가설 설정
      나이는 20-30대에 가까울 수록, 더 높은 등석에 앉아있을 수록, 마지막 위치가 침몰하는 방향의 반대쪽 갑판에 가까울 수록 
    생존 확률이 높다고 가정했고, 구명보트에 여성 먼저 태웠으므로 여성의 생존확률이 더 높을 것이라 가정했다.
     

